// ============================================================
// Image: Assembly-CSharp.dll
// ============================================================

// Namespace: <global>
class GameLog
{
public:

    // Methods
    static void Log(Il2CppObject* message);  // RVA: 0x4B6150
    static void Log(Il2CppObject* message, Il2CppObject* context);  // RVA: 0x4B60F0
};

// Namespace: <global>
class SpriteCollection : public ScriptableObject
{
public:
    uint8_t pad_0000[0x18]; // 0x0000
    Sprite[][] sprites; // 0x0018

    // Methods
    void .ctor();  // RVA: 0x4B6220
};

// Namespace: <global>
struct MonoScriptData
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Byte[][] FilePathsData; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Byte[][] TypesData; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    int32_t TotalTypes; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    int32_t TotalFiles; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    bool IsEditorOnly; // 0x0028
};

// Namespace: <global>
class UnitySourceGeneratedAssemblyMonoScriptTypes_v1
{
public:

    // Methods
    static MonoScriptData Get();  // RVA: 0x4BC620
    void .ctor();  // RVA: 0x4BC430
};

// Namespace: <global>
struct Side
{
public:
    // Static fields
    // static Side Right;
    // static Side Left;
    // static Side Above;
    // static Side Below;

    uint8_t pad_0000[0x10]; // 0x0000
    int32_t value__; // 0x0010
};

namespace AutoBattle.UI
{

    // Namespace: AutoBattle.UI
    class ActionButtonTooltip : public MonoBehaviour
    {
    public:
        // Static fields
        // static float TOOLTIP_WIDTH;
        // static float TOOLTIP_PADDING;
    
        uint8_t pad_0000[0x20]; // 0x0000
        Il2CppString* tooltipText; // 0x0020
        uint8_t pad_0021[0x7]; // 0x0021
        System.Func<System.String> textProvider; // 0x0028
        uint8_t pad_0029[0x7]; // 0x0029
        GameObject* runtimePanel; // 0x0030
        uint8_t pad_0031[0x7]; // 0x0031
        bool usingScenePanel; // 0x0038
        bool isHovering; // 0x0039
        uint8_t pad_003A[0x6]; // 0x003A
        Il2CppString* lastShownText; // 0x0040
        uint8_t pad_0041[0x7]; // 0x0041
        Side side; // 0x0048
    
        // Methods
        void SetTooltipText(Il2CppString* text);  // RVA: 0x4A7D40
        void SetTooltipTextProvider(System.Func<System.String> provider);  // RVA: 0x4A7D30
        void SetSide(Side s);  // RVA: 0x4A7D20
        void OnPointerEnter(PointerEventData* eventData);  // RVA: 0x4A7AC0
        void OnPointerExit(PointerEventData* eventData);  // RVA: 0x4A7A90
        void OnDisable();  // RVA: 0x4A7A90
        void Update();  // RVA: 0x4A7D70
        void HideTooltip();  // RVA: 0x4A7940
        GameObject* CreateRuntimePanel(Il2CppString* textContent);  // RVA: 0x4A7220
        void .ctor();  // RVA: 0x4A7F40
    };

    // Namespace: AutoBattle.UI
    class ActionTooltipPanel : public MonoBehaviour
    {
    public:
        // Static fields
        // static ActionTooltipPanel* <Instance>k__BackingField;
    
        uint8_t pad_0000[0x20]; // 0x0000
        RectTransform* panelRect; // 0x0020
        uint8_t pad_0021[0x7]; // 0x0021
        TMP_Text* tooltipText; // 0x0028
        uint8_t pad_0029[0x7]; // 0x0029
        float padding; // 0x0030
        uint8_t pad_0031[0x3]; // 0x0031
        float gap; // 0x0034
        uint8_t pad_0035[0x3]; // 0x0035
        float maxWidth; // 0x0038
    
        // Methods
        static ActionTooltipPanel* get_Instance();  // RVA: 0x4A8E10
        static void set_Instance(ActionTooltipPanel* value);  // RVA: 0x4A8E50
        void Awake();  // RVA: 0x4A7F90
        void OnDestroy();  // RVA: 0x4A8210
        void Show(Il2CppString* text, RectTransform* anchorRect, Side side);  // RVA: 0x4A8940
        static void PositionPanel(RectTransform* panelRect, RectTransform* anchorRect, RectTransform* canvasRT, Side side, float panelWidth, float panelHeight, float gapPx);  // RVA: 0x4A82E0
        void Hide();  // RVA: 0x4A81E0
        static Canvas* GetRootCanvas(Component* c);  // RVA: 0x4A8080
        void .ctor();  // RVA: 0x4A8DF0
    };

    // Namespace: AutoBattle.UI
    class AnimatedHPBar : public MonoBehaviour
    {
    public:
        uint8_t pad_0000[0x20]; // 0x0000
        Sprite[][] frames; // 0x0020
        uint8_t pad_0021[0x7]; // 0x0021
        float fps; // 0x0028
        uint8_t pad_0029[0x7]; // 0x0029
        Image* fillImage; // 0x0030
        uint8_t pad_0031[0x7]; // 0x0031
        Image* ghostImage; // 0x0038
        uint8_t pad_0039[0x7]; // 0x0039
        float ghostLingerDuration; // 0x0040
        uint8_t pad_0041[0x3]; // 0x0041
        float ghostFadeDuration; // 0x0044
        uint8_t pad_0045[0x3]; // 0x0045
        Color ghostLightColor; // 0x0048
        uint8_t pad_0049[0xF]; // 0x0049
        float currentFill; // 0x0058
        uint8_t pad_0059[0x3]; // 0x0059
        int32_t frameIndex; // 0x005C
        uint8_t pad_005D[0x3]; // 0x005D
        float frameTimer; // 0x0060
        uint8_t pad_0061[0x3]; // 0x0061
        bool ghostFading; // 0x0064
        uint8_t pad_0065[0x3]; // 0x0065
        float ghostElapsed; // 0x0068
        uint8_t pad_0069[0x3]; // 0x0069
        Color ghostStartColor; // 0x006C
        uint8_t pad_006D[0xF]; // 0x006D
        Color ghostEndColor; // 0x007C
    
        // Methods
        void Awake();  // RVA: 0x4A8F80
        void OnEnable();  // RVA: 0x4A9010
        void Update();  // RVA: 0x4A9410
        void UpdateFill(float newFill);  // RVA: 0x4A92B0
        void SetFillImmediate(float newFill);  // RVA: 0x4A9120
        void TriggerGhost(float oldFill);  // RVA: 0x4A9210
        static void ApplyFill(Image* img, float value);  // RVA: 0x4A8EB0
        void .ctor();  // RVA: 0x4A96C0
    };

} // namespace AutoBattle.UI

// Namespace: <global>
class <PlayLoop>d__10
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    AnimatedIconHover* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float <delay>5__2; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t <frameIndex>5__3; // 0x002C

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4B9500
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4B9650
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

namespace AutoBattle.UI
{

    // Namespace: AutoBattle.UI
    class AnimatedIconHover : public MonoBehaviour
    {
    public:
        uint8_t pad_0000[0x20]; // 0x0000
        Image* targetImage; // 0x0020
        uint8_t pad_0021[0x7]; // 0x0021
        Sprite[][] frames; // 0x0028
        uint8_t pad_0029[0x7]; // 0x0029
        float fps; // 0x0030
        uint8_t pad_0031[0x7]; // 0x0031
        Sprite* staticSprite; // 0x0038
        uint8_t pad_0039[0x7]; // 0x0039
        Coroutine* animCoroutine; // 0x0040
    
        // Methods
        void Awake();  // RVA: 0x4A96F0
        void OnPointerEnter(PointerEventData* eventData);  // RVA: 0x4A97E0
        void OnPointerExit(PointerEventData* eventData);  // RVA: 0x4A97D0
        void OnDisable();  // RVA: 0x4A97D0
        void StopAndReset();  // RVA: 0x4A9950
        IEnumerator* PlayLoop();  // RVA: 0x4A98E0
        void .ctor();  // RVA: 0x4A9A00
    };

    // Namespace: AutoBattle.UI
    class ArenaBackground : public MonoBehaviour
    {
    public:
        uint8_t pad_0000[0x20]; // 0x0000
        Sprite* cieloSprite; // 0x0020
        uint8_t pad_0021[0x7]; // 0x0021
        Sprite* livello1Sprite; // 0x0028
        uint8_t pad_0029[0x7]; // 0x0029
        Sprite* lunaSprite; // 0x0030
        uint8_t pad_0031[0x7]; // 0x0031
        Sprite[][] starsFrames; // 0x0038
        uint8_t pad_0039[0x7]; // 0x0039
        float starsFrameRate; // 0x0040
        uint8_t pad_0041[0x3]; // 0x0041
        int32_t starsTrailingFramesToSkip; // 0x0044
        uint8_t pad_0045[0x3]; // 0x0045
        Vector2 moonStart; // 0x0048
        uint8_t pad_0049[0x7]; // 0x0049
        Vector2 moonEnd; // 0x0050
        uint8_t pad_0051[0x7]; // 0x0051
        float moonSpeed; // 0x0058
        uint8_t pad_0059[0x3]; // 0x0059
        bool moonPingPong; // 0x005C
        uint8_t pad_005D[0x3]; // 0x005D
        RectTransform* cieloLayer; // 0x0060
        uint8_t pad_0061[0x7]; // 0x0061
        RectTransform* starsLayer; // 0x0068
        uint8_t pad_0069[0x7]; // 0x0069
        RectTransform* lunaLayer; // 0x0070
        uint8_t pad_0071[0x7]; // 0x0071
        RectTransform* livello1Layer; // 0x0078
        uint8_t pad_0079[0x7]; // 0x0079
        RectTransform* rect; // 0x0080
        uint8_t pad_0081[0x7]; // 0x0081
        Image* starsImage; // 0x0088
        uint8_t pad_0089[0x7]; // 0x0089
        int32_t starsFrameIdx; // 0x0090
        uint8_t pad_0091[0x3]; // 0x0091
        float starsFrameTimer; // 0x0094
        uint8_t pad_0095[0x3]; // 0x0095
        Image* lunaImage; // 0x0098
        uint8_t pad_0099[0x7]; // 0x0099
        float moonT; // 0x00A0
        uint8_t pad_00A1[0x3]; // 0x00A1
        int32_t moonDir; // 0x00A4
        uint8_t pad_00A5[0x3]; // 0x00A5
        bool built; // 0x00A8
    
        // Methods
        void Awake();  // RVA: 0x4A9A10
        void OnEnable();  // RVA: 0x4AA150
        void Build();  // RVA: 0x4A9A70
        RectTransform* CreateLayer(Il2CppString* name, Sprite* sprite, Vector2 size);  // RVA: 0x4A9F00
        void Update();  // RVA: 0x4AA2E0
        void SetSprites(Sprite* cielo, Sprite[][] stars, Sprite* luna, Sprite* livello1);  // RVA: 0x4AA270
        void .ctor();  // RVA: 0x4AA630
    };

} // namespace AutoBattle.UI

// Namespace: <global>
class <>c
{
public:
    // Static fields
    // static <>c* <>9;
    // static System.Func<System.String> <>9__127_6;
    // static System.Func<System.String> <>9__127_7;
    // static System.Func<System.String> <>9__127_1;
    // static System.Func<System.String> <>9__127_2;
    // static System.Func<System.String> <>9__127_3;
    // static UnityAction* <>9__127_4;
    // static System.Func<System.String> <>9__127_5;
    // static System.Func<System.String> <>9__127_10;
    // static System.Func<System.String> <>9__128_0;
    // static System.Func<System.String> <>9__130_0;


    // Methods
    static void .cctor();  // RVA: 0x4BC440
    void .ctor();  // RVA: 0x4BC430
    Il2CppString* <Start>b__127_6();  // RVA: 0x4BC340
    Il2CppString* <Start>b__127_7();  // RVA: 0x4BC3A0
    Il2CppString* <Start>b__127_1();  // RVA: 0x4BC1C0
    Il2CppString* <Start>b__127_2();  // RVA: 0x4BC220
    Il2CppString* <Start>b__127_3();  // RVA: 0x4BC280
    void <Start>b__127_4();  // RVA: 0x4B4660
    Il2CppString* <Start>b__127_5();  // RVA: 0x4BC2E0
    Il2CppString* <Start>b__127_10();  // RVA: 0x4BC010
    Il2CppString* <AttachPlayerHpTooltip>b__128_0();  // RVA: 0x4BBC50
    Il2CppString* <AttachPlayerXpTooltip>b__130_0();  // RVA: 0x4BBE60
};

// Namespace: <global>
class <>c__DisplayClass190_0
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ItemInstance* droppedItem; // 0x0010

    // Methods
    void .ctor();  // RVA: 0x4BC430
    bool <ShowPopupCard>b__0(ItemData* t);  // RVA: 0x4BC400
};

// Namespace: <global>
class <>c__DisplayClass203_0
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ItemInstance* item; // 0x0010

    // Methods
    void .ctor();  // RVA: 0x4BC430
    bool <RefreshDropsList>b__0(ItemData* t);  // RVA: 0x4BC400
};

// Namespace: <global>
class <>c__DisplayClass215_0
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ItemInstance* weaponInstance; // 0x0010

    // Methods
    void .ctor();  // RVA: 0x4BC430
    bool <GetEquippedWeaponData>b__0(ItemData* d);  // RVA: 0x4BC400
};

// Namespace: <global>
class <ApplyDamageVisualsAfterDelay>d__178
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    float delay; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    CombatTurnResult* result; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    BattleScreenUI* <>4__this; // 0x0030

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4B6780
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4B6F60
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

// Namespace: <global>
class <CombatEndPopupSequence>d__185
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BattleScreenUI* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    CombatResult* result; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    bool <willShowAnyPopup>5__2; // 0x0030
    bool <delayPanel>5__3; // 0x0031

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4B6FA0
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4B8030
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

// Namespace: <global>
class <FlashBar>d__214
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4B81B0
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4B81C0
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

// Namespace: <global>
class <FlashEnemyHitRed>d__208
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BattleScreenUI* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Color <orig>5__2; // 0x0028
    uint8_t pad_0029[0xF]; // 0x0029
    Color <red>5__3; // 0x0038
    uint8_t pad_0039[0xF]; // 0x0039
    int32_t <i>5__4; // 0x0048

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4B8200
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4B8520
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

// Namespace: <global>
class <PlayAnimImage>d__153
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BattleScreenUI* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float <delay>5__2; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t <frameIndex>5__3; // 0x002C

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4B86A0
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4B8870
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

// Namespace: <global>
class <PlayDefeatAnimCoroutine>d__156
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BattleScreenUI* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float <delay>5__2; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t <i>5__3; // 0x002C

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4B88B0
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4B8A60
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

// Namespace: <global>
class <PlayEffectOverlay>d__209
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    Image* effectImage; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Sprite[][] effectFrames; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float delaySec; // 0x0030
    uint8_t pad_0031[0x3]; // 0x0031
    float <frameDuration>5__2; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    int32_t <i>5__3; // 0x0038

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4B8AA0
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4B8D40
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

// Namespace: <global>
class <PlayFadeOutInCoroutine>d__182
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BattleScreenUI* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float fadeInDuration; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    float fadeOutDuration; // 0x002C
    uint8_t pad_002D[0x3]; // 0x002D
    float <t>5__2; // 0x0030

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4B8D80
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4B9090
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

// Namespace: <global>
class <PlayLevelCompleteAnimCoroutine>d__159
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BattleScreenUI* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float <delay>5__2; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t <i>5__3; // 0x002C

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4B92C0
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4B94C0
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

// Namespace: <global>
class <PlayProjectileImpact>d__222
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    ItemData* weaponData; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    RectTransform* canvasRect; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Vector2 position; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Sprite[][] <frames>5__2; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    GameObject* <go>5__3; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    Image* <img>5__4; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    float <perFrame>5__5; // 0x0050
    uint8_t pad_0051[0x3]; // 0x0051
    int32_t <i>5__6; // 0x0054

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4B9690
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4B9D80
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

// Namespace: <global>
class <PlayStaminaBtnIconAnim>d__160
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BattleScreenUI* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float <delay>5__2; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t <frameIndex>5__3; // 0x002C

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4B9DC0
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4B9F20
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

// Namespace: <global>
class <PlayVsAnimation>d__184
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BattleScreenUI* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float <frameDuration>5__2; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t <i>5__3; // 0x002C
    uint8_t pad_002D[0x3]; // 0x002D
    float <elapsed>5__4; // 0x0030

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4B9F60
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4BA1A0
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

// Namespace: <global>
class <RefreshBattleTextsNextFrame>d__167
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BattleScreenUI* <>4__this; // 0x0020

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4BA1E0
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4BA4F0
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

// Namespace: <global>
class <RefreshTitleFrameHeightCoroutine>d__267
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BattleScreenUI* <>4__this; // 0x0020

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4BA530
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4BA6B0
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

// Namespace: <global>
class <ShowPopupCoroutine>d__187
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    BattleScreenUI* <>4__this; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Il2CppString* headerText; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Il2CppString* subtitleText; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    ItemInstance* dropItem; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    float duration; // 0x0040

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4BA790
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4BA990
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

// Namespace: <global>
class <SpawnProjectileSpread>d__217
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    ItemData* weaponData; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float extraSpawnDelay; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    int32_t count; // 0x002C
    uint8_t pad_002D[0x3]; // 0x002D
    bool suppressLunge; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    BattleScreenUI* <>4__this; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    RectTransform* from; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    RectTransform* to; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    SpriteAnimator* lungeAnimator; // 0x0050
    uint8_t pad_0051[0x7]; // 0x0051
    float <spread>5__2; // 0x0058
    uint8_t pad_0059[0x3]; // 0x0059
    float <delay>5__3; // 0x005C
    uint8_t pad_005D[0x3]; // 0x005D
    int32_t <pi>5__4; // 0x0060

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4BA9D0
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4BACE0
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

// Namespace: <global>
class <SpawnProjectileVFX>d__221
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    RectTransform* from; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    RectTransform* to; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    ItemData* weaponData; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    float extraSpawnDelay; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    SpriteAnimator* lungeAnimator; // 0x0040
    uint8_t pad_0041[0x7]; // 0x0041
    BattleScreenUI* <>4__this; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    bool triggerLungeOnSpawn; // 0x0050
    uint8_t pad_0051[0x3]; // 0x0051
    float verticalOffset; // 0x0054
    uint8_t pad_0055[0x3]; // 0x0055
    float <travelTime>5__2; // 0x0058
    uint8_t pad_0059[0x3]; // 0x0059
    float <arcHeight>5__3; // 0x005C
    uint8_t pad_005D[0x3]; // 0x005D
    RectTransform* <canvasRect>5__4; // 0x0060
    uint8_t pad_0061[0x7]; // 0x0061
    Vector2 <fromLocal>5__5; // 0x0068
    uint8_t pad_0069[0x7]; // 0x0069
    Vector2 <toLocal>5__6; // 0x0070
    uint8_t pad_0071[0x7]; // 0x0071
    Sprite[][] <frames>5__7; // 0x0078
    uint8_t pad_0079[0x7]; // 0x0079
    GameObject* <go>5__8; // 0x0080
    uint8_t pad_0081[0x7]; // 0x0081
    RectTransform* <rt>5__9; // 0x0088
    uint8_t pad_0089[0x7]; // 0x0089
    Image* <img>5__10; // 0x0090
    uint8_t pad_0091[0x7]; // 0x0091
    Vector2 <dir>5__11; // 0x0098
    uint8_t pad_0099[0x7]; // 0x0099
    float <elapsed>5__12; // 0x00A0
    uint8_t pad_00A1[0x3]; // 0x00A1
    int32_t <frameIdx>5__13; // 0x00A4
    uint8_t pad_00A5[0x3]; // 0x00A5
    float <frameTimer>5__14; // 0x00A8
    uint8_t pad_00A9[0x3]; // 0x00A9
    float <frameDuration>5__15; // 0x00AC

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4BAD20
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4BBC10
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

// Namespace: <global>
class <WaitForPopupDurationOrSkip>d__188
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    bool skippable; // 0x0020
    uint8_t pad_0021[0x3]; // 0x0021
    float duration; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    BattleScreenUI* <>4__this; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    float <elapsed>5__2; // 0x0030

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4BC4B0
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4BC5E0
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

namespace AutoBattle.UI
{

    // Namespace: AutoBattle.UI
    class BattleScreenUI : public MonoBehaviour
    {
    public:
        // Static fields
        // static Vector2 PlayerSlashOnPlayerPos;
        // static float DAMAGE_APPLY_DELAY;
        // static float WEAPON_PHANTOM_DURATION;
        // static int32_t MAX_LOG_LINES;
        // static float PROJECTILE_TRAVEL_TIME_FALLBACK;
        // static System.Collections.Generic.Dictionary<System.String,System.Single> kEnemyContentCenterOffsetPx;
        // static System.Collections.Generic.Dictionary<System.String,System.ValueTuple<System.Single,System.Single>> kEnemyAnimati
        uint8_t pad_0000[0x20]; // 0x0000
        Image* battleBackground; // 0x0020
        uint8_t pad_0021[0x7]; // 0x0021
        Image* battleFrame; // 0x0028
        uint8_t pad_0029[0x7]; // 0x0029
        GameObject* outskirtsBackground; // 0x0030
        uint8_t pad_0031[0x7]; // 0x0031
        GameObject* villageBackground; // 0x0038
        uint8_t pad_0039[0x7]; // 0x0039
        GameObject* graveyardBackground; // 0x0040
        uint8_t pad_0041[0x7]; // 0x0041
        GameObject* forestBackground; // 0x0048
        uint8_t pad_0049[0x7]; // 0x0049
        GameObject* arenaBackground; // 0x0050
        uint8_t pad_0051[0x7]; // 0x0051
        RectTransform* titleFrame; // 0x0058
        uint8_t pad_0059[0x7]; // 0x0059
        TMP_Text* sectorLabel; // 0x0060
        uint8_t pad_0061[0x7]; // 0x0061
        TMP_Text* battleProgressLabel; // 0x0068
        uint8_t pad_0069[0x7]; // 0x0069
        Image* sectorBarFill; // 0x0070
        uint8_t pad_0071[0x7]; // 0x0071
        TMP_Text* playerNameText; // 0x0078
        uint8_t pad_0079[0x7]; // 0x0079
        TMP_Text* playerLevelText; // 0x0080
        uint8_t pad_0081[0x7]; // 0x0081
        TMP_Text* playerHpText; // 0x0088
        uint8_t pad_0089[0x7]; // 0x0089
        Image* playerHpBarEmpty; // 0x0090
        uint8_t pad_0091[0x7]; // 0x0091
        Image* playerHpBarFill; // 0x0098
        uint8_t pad_0099[0x7]; // 0x0099
        TMP_Text* enemyNameText; // 0x00A0
        uint8_t pad_00A1[0x7]; // 0x00A1
        TMP_Text* enemyLevelText; // 0x00A8
        uint8_t pad_00A9[0x7]; // 0x00A9
        TMP_Text* enemyHpText; // 0x00B0
        uint8_t pad_00B1[0x7]; // 0x00B1
        Image* enemyHpBarEmpty; // 0x00B8
        uint8_t pad_00B9[0x7]; // 0x00B9
        Image* enemyHpBarFill; // 0x00C0
        uint8_t pad_00C1[0x7]; // 0x00C1
        Color enemyNameColorVerde; // 0x00C8
        uint8_t pad_00C9[0xF]; // 0x00C9
        Color enemyNameColorGiallo; // 0x00D8
        uint8_t pad_00D9[0xF]; // 0x00D9
        Color enemyNameColorViola; // 0x00E8
        uint8_t pad_00E9[0xF]; // 0x00E9
        TMP_Text* xpLabel; // 0x00F8
        uint8_t pad_00F9[0x7]; // 0x00F9
        Image* xpBarFill; // 0x0100
        uint8_t pad_0101[0x7]; // 0x0101
        TMP_Text* battleLevelLabel; // 0x0108
        uint8_t pad_0109[0x7]; // 0x0109
        Image* staminaIconEmpty; // 0x0110
        uint8_t pad_0111[0x7]; // 0x0111
        Image* staminaIconFull; // 0x0118
        uint8_t pad_0119[0x7]; // 0x0119
        TMP_Text* staminaLabel; // 0x0120
        uint8_t pad_0121[0x7]; // 0x0121
        GameObject* logPanelOverlay; // 0x0128
        uint8_t pad_0129[0x7]; // 0x0129
        TMP_Text* battleLogText; // 0x0130
        uint8_t pad_0131[0x7]; // 0x0131
        ScrollRect* battleLogScroll; // 0x0138
        uint8_t pad_0139[0x7]; // 0x0139
        Button* logToggleButton; // 0x0140
        uint8_t pad_0141[0x7]; // 0x0141
        Button* logCloseButton; // 0x0148
        uint8_t pad_0149[0x7]; // 0x0149
        SidePanelController* logSidePanel; // 0x0150
        uint8_t pad_0151[0x7]; // 0x0151
        GameObject* logSelectedOverlay; // 0x0158
        uint8_t pad_0159[0x7]; // 0x0159
        Transform* dropsListParent; // 0x0160
        uint8_t pad_0161[0x7]; // 0x0161
        GameObject* dropItemPrefab; // 0x0168
        uint8_t pad_0169[0x7]; // 0x0169
        Button* dropsToggleButton; // 0x0170
        uint8_t pad_0171[0x7]; // 0x0171
        GameObject* dropsSelectedOverlay; // 0x0178
        uint8_t pad_0179[0x7]; // 0x0179
        GameObject* dropsPanelOverlay; // 0x0180
        uint8_t pad_0181[0x7]; // 0x0181
        SidePanelController* dropsSidePanel; // 0x0188
        uint8_t pad_0189[0x7]; // 0x0189
        GameObject* resultPanel; // 0x0190
        uint8_t pad_0191[0x7]; // 0x0191
        TextAnimator_TMP* resultText; // 0x0198
        uint8_t pad_0199[0x7]; // 0x0199
        TMP_Text* rewardText; // 0x01A0
        uint8_t pad_01A1[0x7]; // 0x01A1
        GameObject* resultDropCard; // 0x01A8
        uint8_t pad_01A9[0x7]; // 0x01A9
        GameObject* resultCover; // 0x01B0
        uint8_t pad_01B1[0x7]; // 0x01B1
        Image* animImage; // 0x01B8
        uint8_t pad_01B9[0x7]; // 0x01B9
        Sprite[][] animItemFrames; // 0x01C0
        uint8_t pad_01C1[0x7]; // 0x01C1
        float animFps; // 0x01C8
        uint8_t pad_01C9[0x7]; // 0x01C9
        GameObject* defeatGO; // 0x01D0
        uint8_t pad_01D1[0x7]; // 0x01D1
        Image* defeatImage; // 0x01D8
        uint8_t pad_01D9[0x7]; // 0x01D9
        Sprite[][] defeatFrames; // 0x01E0
        uint8_t pad_01E1[0x7]; // 0x01E1
        float defeatFps; // 0x01E8
        uint8_t pad_01E9[0x7]; // 0x01E9
        GameObject* levelCompleteGO; // 0x01F0
        uint8_t pad_01F1[0x7]; // 0x01F1
        Image* levelCompleteImage; // 0x01F8
        uint8_t pad_01F9[0x7]; // 0x01F9
        Sprite[][] levelCompleteFrames; // 0x0200
        uint8_t pad_0201[0x7]; // 0x0201
        float levelCompleteFps; // 0x0208
        uint8_t pad_0209[0x7]; // 0x0209
        Image* staminaBtnIcon; // 0x0210
        uint8_t pad_0211[0x7]; // 0x0211
        Sprite[][] staminaBtnIconFrames; // 0x0218
        uint8_t pad_0219[0x7]; // 0x0219
        float staminaBtnIconFps; // 0x0220
        uint8_t pad_0221[0x7]; // 0x0221
        Coroutine* staminaIconCoroutine; // 0x0228
        uint8_t pad_0229[0x7]; // 0x0229
        Button* settingsToggleButton; // 0x0230
        uint8_t pad_0231[0x7]; // 0x0231
        Sprite* settingsOpenSprite; // 0x0238
        uint8_t pad_0239[0x7]; // 0x0239
        Sprite* settingsClosedSprite; // 0x0240
        uint8_t pad_0241[0x7]; // 0x0241
        GameObject* settingsBar; // 0x0248
        uint8_t pad_0249[0x7]; // 0x0249
        Button* settingsQuitButton; // 0x0250
        uint8_t pad_0251[0x7]; // 0x0251
        Button* settingsOptionsButton; // 0x0258
        uint8_t pad_0259[0x7]; // 0x0259
        Button* settingsStatsButton; // 0x0260
        uint8_t pad_0261[0x7]; // 0x0261
        Button* settingsScaleButton; // 0x0268
        uint8_t pad_0269[0x7]; // 0x0269
        GameObject* settingsPanel; // 0x0270
        uint8_t pad_0271[0x7]; // 0x0271
        Image* playerSpriteImage; // 0x0278
        uint8_t pad_0279[0x7]; // 0x0279
        Image* enemySpriteImage; // 0x0280
        uint8_t pad_0281[0x7]; // 0x0281
        Image* playerSlashImage; // 0x0288
        uint8_t pad_0289[0x7]; // 0x0289
        Image* enemyEffectImage; // 0x0290
        uint8_t pad_0291[0x7]; // 0x0291
        Vector2 parryEffectPos; // 0x0298
        uint8_t pad_0299[0x7]; // 0x0299
        Image* parryEffectImage; // 0x02A0
        uint8_t pad_02A1[0x7]; // 0x02A1
        SpriteCollection* parryEffectCollection; // 0x02A8
        uint8_t pad_02A9[0x7]; // 0x02A9
        Coroutine* parryEffectRoutine; // 0x02B0
        uint8_t pad_02B1[0x7]; // 0x02B1
        Vector2 enemyParryEffectPos; // 0x02B8
        uint8_t pad_02B9[0x7]; // 0x02B9
        Image* enemyParryEffectImage; // 0x02C0
        uint8_t pad_02C1[0x7]; // 0x02C1
        Coroutine* enemyParryEffectRoutine; // 0x02C8
        uint8_t pad_02C9[0x7]; // 0x02C9
        Transform* damagePopupContainer; // 0x02D0
        uint8_t pad_02D1[0x7]; // 0x02D1
        BattleVfxOverlay* battleVfxOverlay; // 0x02D8
        uint8_t pad_02D9[0x7]; // 0x02D9
        GameObject* pvpLabel; // 0x02E0
        uint8_t pad_02E1[0x7]; // 0x02E1
        TMP_Text* suddenDeathLabel; // 0x02E8
        uint8_t pad_02E9[0x7]; // 0x02E9
        CanvasGroup* playerHpBar; // 0x02F0
        uint8_t pad_02F1[0x7]; // 0x02F1
        CanvasGroup* enemyHpBar; // 0x02F8
        uint8_t pad_02F9[0x7]; // 0x02F9
        AnimatedHPBar* playerAnimatedHpBar; // 0x0300
        uint8_t pad_0301[0x7]; // 0x0301
        AnimatedHPBar* enemyAnimatedHpBar; // 0x0308
        uint8_t pad_0309[0x7]; // 0x0309
        SpriteAnimator* playerAnimator; // 0x0310
        uint8_t pad_0311[0x7]; // 0x0311
        SpriteAnimator* enemyAnimator; // 0x0318
        uint8_t pad_0319[0x7]; // 0x0319
        EquipOverlayController* battleOverlay; // 0x0320
        uint8_t pad_0321[0x7]; // 0x0321
        EquipOverlayController* enemyPvPOverlay; // 0x0328
        uint8_t pad_0329[0x7]; // 0x0329
        DamagePopup* damagePopup; // 0x0330
        uint8_t pad_0331[0x7]; // 0x0331
        CombatManager* combatManager; // 0x0338
        uint8_t pad_0339[0x7]; // 0x0339
        System.Collections.Generic.List<System.String> battleLogLines; // 0x0340
        uint8_t pad_0341[0x7]; // 0x0341
        EnemyState* currentEnemy; // 0x0348
        uint8_t pad_0349[0x7]; // 0x0349
        System.Collections.Generic.List<AutoBattle.Data.ItemInstance> sessionDrops; // 0x0350
        uint8_t pad_0351[0x7]; // 0x0351
        bool logPanelOpen; // 0x0358
        bool settingsBarOpen; // 0x0359
        uint8_t pad_035A[0x6]; // 0x035A
        GameObject* dropsBadge; // 0x0360
        uint8_t pad_0361[0x7]; // 0x0361
        int32_t seenDropsCount; // 0x0368
        uint8_t pad_0369[0x7]; // 0x0369
        Image* pvpEnemySlashImage; // 0x0370
        uint8_t pad_0371[0x7]; // 0x0371
        bool isPopupSequenceActive; // 0x0378
        uint8_t pad_0379[0x7]; // 0x0379
        Coroutine* activePopupSequence; // 0x0380
        uint8_t pad_0381[0x7]; // 0x0381
        GameObject* fadeOverlayGO; // 0x0388
        uint8_t pad_0389[0x7]; // 0x0389
        Image* fadeOverlayImage; // 0x0390
        uint8_t pad_0391[0x7]; // 0x0391
        bool isFadeActive; // 0x0398
        uint8_t pad_0399[0x7]; // 0x0399
        Image* vsImage; // 0x03A0
        uint8_t pad_03A1[0x7]; // 0x03A1
        int32_t vsFrameRate; // 0x03A8
        uint8_t pad_03A9[0x7]; // 0x03A9
        Sprite[][] vsFrames; // 0x03B0
        uint8_t pad_03B1[0x7]; // 0x03B1
        bool isVsAnimationActive; // 0x03B8
        uint8_t pad_03B9[0x7]; // 0x03B9
        GameObject* playerTooltipHitbox; // 0x03C0
        uint8_t pad_03C1[0x7]; // 0x03C1
        GameObject* enemyTooltipHitbox; // 0x03C8
        uint8_t pad_03C9[0x7]; // 0x03C9
        RectTransform* overlayBattleScreenRT; // 0x03D0
        uint8_t pad_03D1[0x7]; // 0x03D1
        Vector2 playerIdleLocalCanvas; // 0x03D8
        uint8_t pad_03D9[0x7]; // 0x03D9
        bool playerIdleCached; // 0x03E0
        uint8_t pad_03E1[0x3]; // 0x03E1
        Vector2 enemyIdleLocalCanvas; // 0x03E4
        uint8_t pad_03E5[0x7]; // 0x03E5
        bool enemyIdleCached; // 0x03EC
        uint8_t pad_03ED[0x3]; // 0x03ED
        Coroutine* animCoroutine; // 0x03F0
        uint8_t pad_03F1[0x7]; // 0x03F1
        Coroutine* defeatAnimCoroutine; // 0x03F8
        uint8_t pad_03F9[0x7]; // 0x03F9
        Coroutine* levelCompleteAnimCoroutine; // 0x0400
        uint8_t pad_0401[0x7]; // 0x0401
        LeaderboardUI* leaderboardUI; // 0x0408
        uint8_t pad_0409[0x7]; // 0x0409
        bool dropsGridLayoutEnsured; // 0x0410
        uint8_t pad_0411[0x7]; // 0x0411
        Canvas* _cachedWorldCanvas; // 0x0418
        uint8_t pad_0419[0x7]; // 0x0419
        bool _worldCanvasLookupTried; // 0x0420
    
        // Methods
        static Il2CppString* T(Il2CppString* key);  // RVA: 0x4A1B30
        static Il2CppString* T(Il2CppString* key, Object[][] args);  // RVA: 0x4A1AC0
        static Il2CppString* LocalizeEnemyDisplayName(Il2CppString* fullName, Il2CppString* categoryName);  // RVA: 0x49A230
        bool get_IsPopupSequenceActive();  // RVA: 0x4A7020
        bool get_IsFadeActive();  // RVA: 0x4A7010
        bool get_IsVsAnimationActive();  // RVA: 0x4A7030
        void Start();  // RVA: 0x49FF60
        void AttachPlayerHpTooltip();  // RVA: 0x48F9D0
        void AttachEnemyHpTooltip();  // RVA: 0x48F840
        void AttachPlayerXpTooltip();  // RVA: 0x48FBF0
        void SetupDamagePopup();  // RVA: 0x49E400
        void EnsureTooltipHitboxProxies();  // RVA: 0x493180
        void SyncTooltipHitboxes();  // RVA: 0x499EF0
        void SyncOneTooltipHitbox(GameObject* proxy, Image* targetSprite, Vector2 localOffsetCanvasUnits, bool idleCached, Vector2 idleLocalCanvas);  // RVA: 0x4A1660
        void LateUpdate();  // RVA: 0x499EF0
        void OnEnable();  // RVA: 0x49AC40
        void OnDisable();  // RVA: 0x49A360
        void ToggleLogPanel();  // RVA: 0x4A1E40
        void ToggleDropsPanel();  // RVA: 0x4A1B90
        void SetPanelOverlays(bool log, bool drops);  // RVA: 0x49E0D0
        static void AddTooltipToButton(Button* btn, System.Func<System.String> textProvider, Side side);  // RVA: 0x48F430
        void ToggleSettingsBar();  // RVA: 0x4A1FE0
        void UpdateSettingsToggleIcon();  // RVA: 0x4A6150
        void SetResultPanelActive(bool active, bool showAnim, bool playSfx);  // RVA: 0x49E1B0
        IEnumerator* PlayAnimImage();  // RVA: 0x49B640
        void PlayDefeatAnimation();  // RVA: 0x49B720
        IEnumerator* PlayDefeatAnimCoroutine();  // RVA: 0x49B6B0
        void PlayLevelCompleteAnimation();  // RVA: 0x49BC00
        IEnumerator* PlayLevelCompleteAnimCoroutine();  // RVA: 0x49BB90
        IEnumerator* PlayStaminaBtnIconAnim();  // RVA: 0x49BFE0
        void OnQuitClicked();  // RVA: 0x49B4C0
        void OnLeaderboardClicked();  // RVA: 0x49B3E0
        void ToggleSettingsPanel();  // RVA: 0x4A2140
        void RefreshBattleUI();  // RVA: 0x49C2D0
        void HandleLanguageChanged();  // RVA: 0x497EB0
        IEnumerator* RefreshBattleTextsNextFrame();  // RVA: 0x49C260
        void EnsureSuddenDeathLabel();  // RVA: 0x492D00
        void UpdateProgressDisplay(int32_t sector);  // RVA: 0x4A54F0
        void UpdatePlayerHpDisplay(PlayerState* player);  // RVA: 0x4A51B0
        void UpdateEnemyHpDisplay(EnemyState* enemy);  // RVA: 0x4A35F0
        void UpdateXpDisplay(PlayerState* player);  // RVA: 0x4A6420
        void UpdateStaminaDisplay(PlayerState* player);  // RVA: 0x4A6230
        void RefreshEnemyNameLabel(EnemyState* enemy);  // RVA: 0x49D340
        void HandleCombatStart(EnemyState* enemy);  // RVA: 0x496C10
        void HandleCombatTurn(CombatTurnResult* result);  // RVA: 0x497720
        IEnumerator* ApplyDamageVisualsAfterDelay(CombatTurnResult* result, float delay);  // RVA: 0x48F7A0
        void HandleCombatEnd(CombatResult* result);  // RVA: 0x495A40
        void HandleStaminaDepleted();  // RVA: 0x497F40
        void EnsureFadeOverlay();  // RVA: 0x492270
        IEnumerator* PlayFadeOutInCoroutine(float fadeInDuration, float fadeOutDuration);  // RVA: 0x49BAF0
        void StartVsSplash();  // RVA: 0x49FE30
        IEnumerator* PlayVsAnimation();  // RVA: 0x49C050
        IEnumerator* CombatEndPopupSequence(CombatResult* result);  // RVA: 0x491890
        static bool ShouldShowAnyPopup(CombatResult* result);  // RVA: 0x49F400
        IEnumerator* ShowPopupCoroutine(Il2CppString* headerText, Il2CppString* subtitleText, ItemInstance* dropItem, float duration);  // RVA: 0x49F710
        IEnumerator* WaitForPopupDurationOrSkip(float duration, bool skippable);  // RVA: 0x4A6800
        bool PopupSkipClickedThisFrame();  // RVA: 0x49C0C0
        void ShowPopupCard(ItemInstance* droppedItem);  // RVA: 0x49F460
        static Il2CppString* WrapWave(CombatResult* result, Il2CppString* body);  // RVA: 0x4A68A0
        Il2CppString* BuildSectorClearedText(CombatResult* result);  // RVA: 0x491140
        Il2CppString* BuildArenaActivatedText(CombatResult* result);  // RVA: 0x48FE10
        static Il2CppString* BuildLevelUpText(CombatResult* result);  // RVA: 0x490870
        static Il2CppString* BuildPvPResultText(CombatResult* result);  // RVA: 0x490AC0
        static Il2CppString* BuildPvPRewardSubtitle(CombatResult* result);  // RVA: 0x490E20
        static Il2CppString* BuildArenaWaveClearedText(CombatResult* result);  // RVA: 0x490340
        static Il2CppString* BuildArenaWaveProgressText(CombatResult* result);  // RVA: 0x490650
        static Il2CppString* BuildArenaDefeatText(CombatResult* result);  // RVA: 0x490160
        void SpawnDamagePopup(CombatTurnResult* result);  // RVA: 0x49F7F0
        void HandleHealTick(int32_t healAmount);  // RVA: 0x497C20
        void HandleEnemyHealTick(int32_t healAmount);  // RVA: 0x4977E0
        void RefreshDropsList();  // RVA: 0x49C8D0
        void EnsureDropsGridLayout();  // RVA: 0x491E00
        GameObject* CreateDropLabel(Il2CppString* text, Color color);  // RVA: 0x491BD0
        void TriggerHitAnimation(bool hitPlayer);  // RVA: 0x4A2320
        IEnumerator* FlashEnemyHitRed();  // RVA: 0x493BF0
        IEnumerator* PlayEffectOverlay(Image* effectImage, Sprite[][] effectFrames, float delaySec);  // RVA: 0x49B860
        void PlayParryEffect();  // RVA: 0x49BD40
        void EnsureParryEffectImage();  // RVA: 0x4928F0
        void PlayEnemyParryEffect();  // RVA: 0x49B900
        void EnsureEnemyParryEffectImage();  // RVA: 0x491E80
        IEnumerator* FlashBar(CanvasGroup* bar);  // RVA: 0x493BA0
        ItemData* GetEquippedWeaponData(Il2CppString* slotKey);  // RVA: 0x495330
        ItemData* GetPvPEnemyWeaponData(EnemyState* enemy, Il2CppString* slotKey);  // RVA: 0x495550
        IEnumerator* SpawnProjectileSpread(RectTransform* from, RectTransform* to, int32_t count, ItemData* weaponData, SpriteAnimator* lungeAnimator, float extraSpawnDelay, bool suppressLunge);  // RVA: 0x49FC30
        Canvas* FindWorldCanvas();  // RVA: 0x493A70
        IEnumerator* SpawnProjectileVFX(RectTransform* from, RectTransform* to, float verticalOffset, ItemData* weaponData, bool triggerLungeOnSpawn, SpriteAnimator* lungeAnimator, float extraSpawnDelay);  // RVA: 0x49FD30
        IEnumerator* PlayProjectileImpact(RectTransform* canvasRect, Vector2 position, ItemData* weaponData);  // RVA: 0x49BF30
        void AppendBattleLog(Il2CppString* line);  // RVA: 0x48F560
        SpriteCollection* LoadSlashSottoCollection();  // RVA: 0x49A170
        SpriteCollection* LoadSlashSopraCollection();  // RVA: 0x49A120
        SpriteCollection* LoadSlashAttack3Collection();  // RVA: 0x49A080
        SpriteCollection* LoadSlashRightAboveCollection();  // RVA: 0x49A0D0
        SpriteCollection* LoadMagicAttackCollection();  // RVA: 0x49A030
        bool HasAnyMeleeWeaponEquipped();  // RVA: 0x498140
        bool IsMeleeInSlot(PlayerState* ps, Il2CppString* slotKey);  // RVA: 0x499760
        bool IsRangedInSlot(PlayerState* ps, Il2CppString* slotKey);  // RVA: 0x499D20
        void RefreshPlayerAttackAnimationGate();  // RVA: 0x49D4F0
        static Attack2Mode ResolveAttack2Mode(bool meleeArma1, bool meleeArma2);  // RVA: 0x49DCD0
        bool HasPvPMeleeWeaponEquipped(EnemyState* enemy);  // RVA: 0x498210
        bool IsPvPMeleeInSlot(EnemyState* enemy, Il2CppString* slotKey);  // RVA: 0x499910
        bool IsPvPRangedInSlot(EnemyState* enemy, Il2CppString* slotKey);  // RVA: 0x499B10
        void RefreshPlayerSlashSprites();  // RVA: 0x49D650
        Color GetWeapon1SlashColor();  // RVA: 0x4958C0
        Color GetWeapon2SlashColor();  // RVA: 0x495980
        Color GetElementSlashColor(ElementCategory cat);  // RVA: 0x493D90
        Il2CppString* GetCharacterIdleResourceSuffix();  // RVA: 0x493C60
        static Il2CppString* ResolveCharacterIdleResourceSuffix(CharacterType c);  // RVA: 0x49DDC0
        static Il2CppString* ResolveCharacterAttackPrefix(CharacterType c);  // RVA: 0x49DCF0
        void InitPlayerSprite();  // RVA: 0x498450
        void UpdateEnemySprite(EnemyState* enemy);  // RVA: 0x4A38A0
        void SetupPvPEnemyOverlay(EnemyState* enemy);  // RVA: 0x49E6C0
        void SetupPvPTooltip(EnemyState* enemy);  // RVA: 0x49F1B0
        void ClearPvPTooltip();  // RVA: 0x4917C0
        void SetupPvETooltip(EnemyState* enemy);  // RVA: 0x49E560
        void ClearPvETooltip();  // RVA: 0x4916F0
        float ComputeEnemyAlignedY(Il2CppString* categoryName, float frameSize, float displaySize);  // RVA: 0x491920
        EnemyCategoryData* FindEnemyCategoryData(Il2CppString* categoryName);  // RVA: 0x493710
        Il2CppString* GetEnemySpriteResource(Il2CppString* categoryName);  // RVA: 0x494E90
        Il2CppString* GetEnemyAttackResource(Il2CppString* categoryName);  // RVA: 0x494060
        Il2CppString* GetEnemyHitResource(Il2CppString* categoryName);  // RVA: 0x4949A0
        Il2CppString* GetEnemyDeathResource(Il2CppString* categoryName);  // RVA: 0x494500
        Il2CppString* GetEnemyAttackEffectResource(Il2CppString* categoryName);  // RVA: 0x493E90
        Color GetEnemyNameColor(EnemyColor color);  // RVA: 0x494E40
        void OnRestClicked();  // RVA: 0x49B5B0
        void SetEnemyHpVisible(bool visible);  // RVA: 0x49DF80
        Color GetRarityColor(Il2CppString* rarity);  // RVA: 0x495750
        void SetBarFill(Image* fillImage, float value);  // RVA: 0x49DE90
        void UpdateSectorBackground(int32_t sectorIndex);  // RVA: 0x4A5CE0
        void RefreshTitleFrameHeight();  // RVA: 0x49DBC0
        IEnumerator* RefreshTitleFrameHeightCoroutine();  // RVA: 0x49DB50
        void .ctor();  // RVA: 0x4A6EC0
        static void .cctor();  // RVA: 0x4A6920
        void <Start>b__127_0();  // RVA: 0x4A32F0
        void <Start>b__127_8();  // RVA: 0x4A33D0
        void <Start>b__127_9();  // RVA: 0x4A34A0
        Il2CppString* <AttachEnemyHpTooltip>b__129_0();  // RVA: 0x4A3190
        void <ToggleSettingsPanel>b__164_0();  // RVA: 0x4A3570
    };

} // namespace AutoBattle.UI

// Namespace: <global>
class ElementVfxMapping
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ElementCategory category; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    GameObject* vfxPrefab; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    Vector2 position; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float displaySize; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Sprite[][] frames; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    int32_t repeatCount; // 0x0038
    uint8_t pad_0039[0x3]; // 0x0039
    float repeatSpread; // 0x003C

    // Methods
    void .ctor();  // RVA: 0x4AF260
};

// Namespace: <global>
class VfxSlot
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    GameObject* vfxPrefab; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Vector2 position; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    float displaySize; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    Sprite[][] frames; // 0x0028

    // Methods
    void .ctor();  // RVA: 0x4BC430
};

// Namespace: <global>
class ElementPositionEntry
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    ElementCategory category; // 0x0010
    uint8_t pad_0011[0x3]; // 0x0011
    Vector2 position; // 0x0014
    uint8_t pad_0015[0x7]; // 0x0015
    bool overridePosition; // 0x001C
    uint8_t pad_001D[0x3]; // 0x001D
    float displaySize; // 0x0020

    // Methods
    void .ctor();  // RVA: 0x4AF250
};

// Namespace: <global>
class PerEnemyVfxOverride
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    Il2CppString* enemyCategoryName; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    bool overrideCrit; // 0x0018
    uint8_t pad_0019[0x3]; // 0x0019
    Vector2 critPosition; // 0x001C
    uint8_t pad_001D[0x7]; // 0x001D
    float critDisplaySize; // 0x0024
    uint8_t pad_0025[0x3]; // 0x0025
    bool overrideHeal; // 0x0028
    uint8_t pad_0029[0x3]; // 0x0029
    Vector2 healPosition; // 0x002C
    uint8_t pad_002D[0x7]; // 0x002D
    float healDisplaySize; // 0x0034
    uint8_t pad_0035[0x3]; // 0x0035
    System.Collections.Generic.List<AutoBattle.UI.BattleVfxOverlay.ElementPositionEntry> elementOverrides; // 0x0038

    // Methods
    void .ctor();  // RVA: 0x4B61A0
};

// Namespace: <global>
class <DelayedVfxAt>d__76
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    float delay; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    BattleVfxOverlay* <>4__this; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    RectTransform* anchor; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    Sprite[][] frames; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    float size; // 0x0040
    uint8_t pad_0041[0x3]; // 0x0041
    float duration; // 0x0044
    uint8_t pad_0045[0x3]; // 0x0045
    Vector2 position; // 0x0048
    uint8_t pad_0049[0x7]; // 0x0049
    Vector2 offset; // 0x0050

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4B8070
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4B8170
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

// Namespace: <global>
class <PlayFlipbook>d__81
{
public:
    uint8_t pad_0000[0x10]; // 0x0000
    int32_t <>1__state; // 0x0010
    uint8_t pad_0011[0x7]; // 0x0011
    Il2CppObject* <>2__current; // 0x0018
    uint8_t pad_0019[0x7]; // 0x0019
    Sprite[][] frames; // 0x0020
    uint8_t pad_0021[0x7]; // 0x0021
    float duration; // 0x0028
    uint8_t pad_0029[0x7]; // 0x0029
    Image* img; // 0x0030
    uint8_t pad_0031[0x7]; // 0x0031
    GameObject* host; // 0x0038
    uint8_t pad_0039[0x7]; // 0x0039
    int32_t <n>5__2; // 0x0040
    uint8_t pad_0041[0x3]; // 0x0041
    float <perFrame>5__3; // 0x0044
    uint8_t pad_0045[0x3]; // 0x0045
    int32_t <i>5__4; // 0x0048

    // Methods
    void .ctor(int32_t <>1__state);  // RVA: 0x4B6750
    void System.IDisposable.Dispose();  // RVA: 0x4B4660
    bool MoveNext();  // RVA: 0x4B90D0
    Il2CppObject* System.Collections.Generic.IEnumerator<System.Object>.get_Current();  // RVA: 0x4B6700
    void System.Collections.IEnumerator.Reset();  // RVA: 0x4B9280
    Il2CppObject* System.Collections.IEnumerator.get_Current();  // RVA: 0x4B6700
};

namespace AutoBattle.UI
{

    // Namespace: AutoBattle.UI
    class BattleVfxOverlay : public MonoBehaviour
    {
    public:
        // Static fields
        // static Il2CppString* PLAYER_TARGET_KEY;
        // static Il2CppString* PVP_CATEGORY_KEY;
    
        uint8_t pad_0000[0x20]; // 0x0000
        RectTransform* canvasRect; // 0x0020
        uint8_t pad_0021[0x7]; // 0x0021
        RawImage* overlayRawImage; // 0x0028
        uint8_t pad_0029[0x7]; // 0x0029
        VfxSlot* critVfx; // 0x0030
        uint8_t pad_0031[0x7]; // 0x0031
        VfxSlot* healVfx; // 0x0038
        uint8_t pad_0039[0x7]; // 0x0039
        VfxSlot* meleeSlashVfx; // 0x0040
        uint8_t pad_0041[0x7]; // 0x0041
        System.Collections.Generic.List<AutoBattle.UI.BattleVfxOverlay.ElementVfxMapping> elementVfxMappings; // 0x0048
        uint8_t pad_0049[0x7]; // 0x0049
        System.Collections.Generic.List<AutoBattle.UI.BattleVfxOverlay.PerEnemyVfxOverride> perEnemyOverrides; // 0x0050
        uint8_t pad_0051[0x7]; // 0x0051
        float vfxDisplaySize; // 0x0058
        uint8_t pad_0059[0x3]; // 0x0059
        float vfxDuration; // 0x005C
        uint8_t pad_005D[0x3]; // 0x005D
        float elementalDisplaySize; // 0x0060
        uint8_t pad_0061[0x3]; // 0x0061
        float elementalDuration; // 0x0064
        uint8_t pad_0065[0x3]; // 0x0065
        Color slashColorFrost; // 0x0068
        uint8_t pad_0069[0xF]; // 0x0069
        Color slashColorFlame; // 0x0078
        uint8_t pad_0079[0xF]; // 0x0079
        Color slashColorArcane; // 0x0088
        uint8_t pad_0089[0xF]; // 0x0089
        Color slashColorHoly; // 0x0098
        uint8_t pad_0099[0xF]; // 0x0099
        Color slashColorShadow; // 0x00A8
        uint8_t pad_00A9[0xF]; // 0x00A9
        Il2CppString* projectileSpritesResource; // 0x00B8
        uint8_t pad_00B9[0x7]; // 0x00B9
        Il2CppString* projectileImpactSpritesResource; // 0x00C0
        uint8_t pad_00C1[0x7]; // 0x00C1
        float projectileTravelTime; // 0x00C8
        uint8_t pad_00C9[0x3]; // 0x00C9
        float projectileSize; // 0x00CC
        uint8_t pad_00CD[0x3]; // 0x00CD
        float projectileImpactSize; // 0x00D0
        uint8_t pad_00D1[0x3]; // 0x00D1
        float projectileImpactDuration; // 0x00D4
        uint8_t pad_00D5[0x3]; // 0x00D5
        float projectileArcHeight; // 0x00D8
        uint8_t pad_00D9[0x3]; // 0x00D9
        int32_t projectileAttack2Count; // 0x00DC
        uint8_t pad_00DD[0x3]; // 0x00DD
        float projectileSpreadOffset; // 0x00E0
        uint8_t pad_00E1[0x3]; // 0x00E1
        float projectileSpreadDelay; // 0x00E4
        uint8_t pad_00E5[0x3]; // 0x00E5
        bool projectileRotateToDirection; // 0x00E8
        uint8_t pad_00E9[0x3]; // 0x00E9
        Color projectileTint; // 0x00EC
        uint8_t pad_00ED[0xF]; // 0x00ED
        Color projectileImpactTint; // 0x00FC
        uint8_t pad_00FD[0x13]; // 0x00FD
        System.Collections.Generic.Dictionary<AutoBattle.Data.ElementCategory,AutoBattle.UI.BattleVfxOverlay.ElementVfxMapping> elementMappingLookup; // 0x0110
        uint8_t pad_0111[0x7]; // 0x0111
        System.Collections.Generic.Dictionary<System.String,AutoBattle.UI.BattleVfxOverlay.PerEnemyVfxOverride> perEnemyOverrideLookup; // 0x0118
        uint8_t pad_0119[0x7]; // 0x0119
        CombatManager* _combatManager; // 0x0120
    
        // Methods
